{"pageProps":{"post":{"title":"Headless Adaptive Form : Creating a Multi Language Multistep Form","date":"2020-03-16T05:35:07.322Z","slug":["lab2","localize-form"],"content":"\n# Localisation of a form\n\nTo present form to different end users, it needs to be localized in the language of that user. The visual studio code extension will help us extracting out the string from the Form that needs translation. After than a human or a machine translation setup can be used to translate those strings. \n\n> In this tutorial we are going to use human translation\n\n* Open the form model definition created earlier in Visual Studio Code. you should see a FORM TREE menu in the explorer. On the right of FORM TREE, you should see an icon to translate form definition. Please click this icon to harvest localisable keys and dictionary creation.\n\n![Image](/assets/tutorial/lab2/vscode_icon.png)\n\n* You should see `afs:translationIds` key under properties for all form objects which contains localisable keys.\n* To preview the form in a particular locale, we have made use of react-router. With the help of this library, we could pass language in the URL path.\n* Preview the form on your local development server by navigating to `ui.frontend.react.forms.af` module and using the following command\n* Change the translation for the string `Identify Yourself` in the de-DE language by navigating to `generated/__localization__` folder. For now, let's change it to `Identify Yourself de`. You can change any other string as well\n* Open the form in local development server by navigating to `localhost:3000/de-DE` and you should see the above string translated. The dictionary is fetched from the local development server, you can check the network tab in browser dev tools.\n\n> The Plugin has a bug and translation works if there is only 1 folder added in the workspace","toc":[{"level":1,"text":"Localisation of a form","id":"localisation-of-a-form"}],"prevTitle":"Finishing the form","prevSlug":["lab2","finishing-touches"],"subTitle":"Localizing the form","kind":"tutorials"}},"__N_SSG":true}